biddr_api/app/controllers/api/v1/auctions_controller.rb

    def index
        auctions = Auction.order created_at: :desc
---
SELECT "auctions".* FROM "auctions" ORDER BY "auctions"."created_at" DESC

    def create
        auction = Auction.new auction_params
        # auction.user = User.first
        if auction.save
---
INSERT INTO "auctions" ("title", "description", "end_date", "reserve_price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

        def find_auction
            @auction = Auction.find params[:id]
---
SELECT "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT $2  [["id", 51], ["LIMIT", 1]]