biddr_api/app/controllers/api/v1/bids_controller.rb

SELECT "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT $2  [["id", 91], ["LIMIT", 1]]
INSERT INTO "bids" ("bid_price", "auction_id", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["bid_price", 59.0], ["auction_id", 91], ["created_at", "2021-07-14 22:29:38.186176"], ["updated_at", "2021-07-14 22:29:38.186176"], ["user_id", 67]]
---
    def create
        @auction = Auction.find params[:auction_id]
        bid= Bid.new bid_params
        bid.auction = @auction
        bid.user = current_user
        if bid.save